app/Models/M_Pendataan.php

SELECT *
FROM `pendataan`
---
    public function getAllData()
    {
        return $this->db->table('pendataan')->get();

INSERT INTO `pendataan` (`data`, `nama`) VALUES ('235465656', 'Siswa 2')
---
    public function tambah($data)
    {
        return $this->db->table('pendataan')->insert($data);